
# Лабораторная работа. Просмотр таблицы MAC-адресов коммутатора

![](./1.jpeg)

| Устройство    | Интерфейс       | IP-адрес / префикс |
| :------------ |:---------------:| ------------------:|
| S1            | VLAN 1          | 192.168.1.11 /24  |
| S2            | VLAN 1          | 192.168.1.12 /24  |
| PC-A          | NIC             | 192.168.1.1/24     |
| PC-B          | NIC             | 192.168.1.2/24     |
|               |                 |                    |






### Цели и задачи 
+ Часть 1. Создание и настройка сети
+ Часть 2. Изучение таблицы МАС-адресов коммутатора


В ходе лабораторной работы использовался коммутатор Cisco 2960 (ver ios 15.0(2)SE4)

Для выполнения данной лабораторной работы необходимо настроить все хосты и коммутаторы и назначить ip адреса согласно таблице приведенной выше. Так же следует задать имя коммутаторам, назначить ip адрес и настроить дистанционное подключение по протоколу ssh, предварительно подключившись через консоль управления.

![](./2.jpeg)

Логин и пароль следует задать везде одинаковый:  cisco:class.

Перечень выполняемых команд приводится ниже:

```

```





![](https://github.com/Kuc-Ig/Labs-Lan-IOS-Base/blob/main/Labs/Lab-1/image-1.jpeg)





При первом запуске необходимо отключить все интерфейсы коммутатора, для этого необходимо последовательно ввести следующие команды:

```
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int
Switch(config)#interface ran
Switch(config)#interface range fas
Switch(config)#interface range fastEthernet 0/0-24
interface range not validated - command rejected
Switch(config)#interface range fastEthernet 0/1-24
Switch(config-if-range)#shu
Switch(config-if-range)#shutdown
```
После чего убедиться что команда выполнена успешно с помощью команды show running config (sh run):

![](./image-2.jpeg)

Для того что бы установить сетевую связанность с рабочей станцией и коммутатором, необходимо назначить ip адресс на рабочей станции (192.168.1.10 /24) и на коммутаторе (192.168.1.2 /24).
Для назначение ip адреса на коммутаторе необходимо выполнить в консоле следующие команды в режиме конфигурации:
```
S1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
S1(config)#int
S1(config)#interface vl
S1(config)#interface vlan 1
S1(config-if)#no shu
S1(config-if)#no shutdown 

S1(config-if)#
```
После чего проверить сетевую связанность между рабочей станцией и коммутатором:

![](./jpeg-3.jpeg)

Далее необходимо настроить удаленный доступ, для этого необходимо для режима виртуальных линий указать протокол подключения (ssh или telnet) и используемую учетную запись для подключения (в данном случае указывается локальная УЗ):

![](./4.jpeg)

![PTK файл без erase enable password: class](./Lab-1-no-erase.pkt)

### Инициализация и перезагрузка коммутатора

Воспользуйтесь командой show flash, чтобы определить, были ли созданы сети VLAN на коммутаторе, после введите команду erase startup-config, чтобы удалить файл загрузочной конфигурации из NVRAM. 

![](./5.jpeg)

![PTK файл после erase](./Lab-1-erase.pkt)
